[
  {
     "q":"Which Azure resource determines the compute resources (size, scale count, OS) for an App Service Web App?",
     "opts":[
        "App Service Environment",
        "Web App",
        "App Service Plan",
        "Deployment Slot"
     ],
     "a":2
  },
  {
     "q":"What App Service feature enables zero-downtime deployment by allowing you to stage an application version before swapping it into production?",
     "opts":[
        "Scale Sets",
        "Azure Traffic Manager",
        "Deployment Slots",
        "WebJobs"
     ],
     "a":2
  },
  {
     "q":"Which minimum App Service Plan pricing tier is required to utilize deployment slots and custom domain SSL bindings?",
     "opts":[
        "Free",
        "Basic",
        "Standard",
        "Shared"
     ],
     "a":2
  },
  {
     "q":"What type of DNS record is commonly used to map a naked domain (e.g., example.com) to an Azure App Service?",
     "opts":[
        "CNAME",
        "PTR",
        "MX",
        "A or ALIAS"
     ],
     "a":3
  },
  {
     "q":"Which feature of App Service allows you to restrict network access to your application based on a list of IP addresses or VNet subnets?",
     "opts":[
        "Network Security Groups",
        "Firewall Rules",
        "Access Restrictions",
        "Private Endpoints"
     ],
     "a":2
  },
  {
     "q":"What App Service feature allows the application to securely access other Azure services without storing credentials in the code?",
     "opts":[
        "Application Settings",
        "Service Principals",
        "Managed Identity",
        "Client Secrets"
     ],
     "a":2
  },
  {
     "q":"What is the name of the advanced diagnostic console and toolset (often accessible via /scm) for Azure App Service?",
     "opts":[
        "Azure CLI",
        "Kudu",
        "Azure Monitor",
        "Log Analytics"
     ],
     "a":1
  },
  {
     "q":"In Azure App Service, where are application-specific settings like environment variables and connection strings configured?",
     "opts":[
        "web.config file",
        "Application Settings and Connection Strings in the Azure Portal",
        "Azure Key Vault",
        "Local system environment variables"
     ],
     "a":1
  },
  {
     "q":"What service is primarily used to define rules for automatically scaling an App Service Plan based on metrics like CPU usage or HTTP queue length?",
     "opts":[
        "Azure Load Balancer",
        "Azure Traffic Manager",
        "Azure Autoscale",
        "Azure CDN"
     ],
     "a":2
  },
  {
     "q":"Azure App Service supports hosting applications on which operating systems?",
     "opts":[
        "Windows only",
        "Linux only",
        "Windows and Linux",
        "Windows, Linux, and macOS"
     ],
     "a":2
  },
  {
     "q":"What specific feature within App Service allows a user to deploy a Docker container image instead of traditional code?",
     "opts":[
        "Azure Container Instances",
        "Web App for Containers",
        "Azure Kubernetes Service",
        "App Service Environment"
     ],
     "a":1
  },
  {
     "q":"To enable an App Service to make outbound calls to resources within a private Azure Virtual Network, which feature must be configured?",
     "opts":[
        "Private Endpoint",
        "App Gateway",
        "VNet Integration",
        "Public IP Address"
     ],
     "a":2
  },
  {
     "q":"Which Azure service is recommended for in-depth monitoring, performance analysis, and detailed logging of an App Service application?",
     "opts":[
        "Azure Diagnostics",
        "Azure Sentinel",
        "Azure Event Hubs",
        "Application Insights"
     ],
     "a":3
  },
  {
     "q":"The cost of running an Azure App Service application is primarily determined by which component?",
     "opts":[
        "Total number of requests",
        "Data transfer volume",
        "App Service Plan tier and instance count",
        "Application runtime language"
     ],
     "a":2
  },
  {
     "q":"What App Service setting should be enabled on a deployment slot to ensure the application is initialized and warmed up before a production swap occurs?",
     "opts":[
        "Always On",
        "Health Check",
        "Auto Swap",
        "Auto Heal"
     ],
     "a":0
  },
  {
     "q":"What feature allows you to send a small, specified percentage of production traffic to a non-production deployment slot for testing?",
     "opts":[
        "Azure Traffic Manager Profiles",
        "Staging Traffic Rules",
        "Traffic Routing",
        "Azure Front Door"
     ],
     "a":2
  },
  {
     "q":"Which of the following is a common source control option for continuous deployment to Azure App Service?",
     "opts":[
        "Azure File Share",
        "Local Git repository on your machine",
        "Google Drive",
        "GitHub/Azure DevOps"
     ],
     "a":3
  },
  {
     "q":"What is the *easiest* and *free* way to secure a custom domain in Azure App Service?",
     "opts":[
        "Upload a wildcard certificate",
        "Use App Service Managed Certificate",
        "Purchase a certificate from Azure Key Vault",
        "Configure HTTPS enforcement only"
     ],
     "a":1
  },
  {
     "q":"Which App Service feature is used to run background tasks, such as continuous processing or scheduled jobs, within the same environment as your web app?",
     "opts":[
        "Azure Functions",
        "Azure Batch",
        "Azure WebJobs",
        "Azure Logic Apps"
     ],
     "a":2
  },
  {
     "q":"For customers requiring a fully isolated and dedicated environment for running App Service apps, which resource should be used?",
     "opts":[
        "Dedicated App Service Plan",
        "App Service Environment (ASE)",
        "Isolated Virtual Network",
        "Premium App Service Plan"
     ],
     "a":1
  },
  {
     "q":"Which of the following is a supported runtime stack for a Linux-based Azure App Service?",
     "opts":[
        "Classic ASP",
        ".NET Framework",
        "Node.js",
        "Java EE"
     ],
     "a":2
  },
  {
     "q":"What is the main function of the 'Always On' setting for an Azure App Service?",
     "opts":[
        "To enforce HTTPS traffic only",
        "To keep the site running and prevent the worker process from being shut down due to inactivity",
        "To enable continuous deployment",
        "To ensure automatic scaling is always active"
     ],
     "a":1
  },
  {
     "q":"Which App Service Plan tier is the minimum required to receive a financially backed Service Level Agreement (SLA) from Microsoft?",
     "opts":[
        "Free/Shared",
        "Basic",
        "Standard",
        "Developer"
     ],
     "a":1
  },
  {
     "q":"What common protocol is available for manually deploying application files directly to the App Service file system?",
     "opts":[
        "SFTP/FTPS",
        "SMB",
        "HTTP PUT",
        "RDP"
     ],
     "a":0
  },
  {
     "q":"What is the maximum number of deployment slots available for an App Service Web App in the Standard pricing tier?",
     "opts":[
        "1",
        "5",
        "10",
        "20"
     ],
     "a":1
  },
  {
     "q":"In App Service, which type of networking configuration is used to allow the app to make secure, outbound connections to resources inside a peered Azure Virtual Network?",
     "opts":[
        "Private Endpoint",
        "Service Endpoint",
        "VNet Integration",
        "Hybrid Connections"
     ],
     "a":2
  },
  {
     "q":"What is the primary function of an Azure App Service Private Endpoint?",
     "opts":[
        "To encrypt outbound traffic to a database",
        "To allow inbound connections to the app using a private IP address within a VNet",
        "To provide a dedicated public IP address for the app",
        "To integrate with Azure Key Vault"
     ],
     "a":1
  },
  {
     "q":"Which App Service setting in the Azure Portal is used to map a custom domain to the application's IP address, requiring an A record or ALIAS record?",
     "opts":[
        "Custom Hostnames",
        "SSL Bindings",
        "Traffic Routing",
        "Access Restrictions"
     ],
     "a":0
  },
  {
     "q":"Which networking feature is best suited for connecting an Azure App Service web app to a single database server running on-premises?",
     "opts":[
        "App Service Environment",
        "VNet Peering",
        "Private Endpoint",
        "Hybrid Connections"
     ],
     "a":3
  },
  {
     "q":"What are the two types of Managed Identity that can be assigned to an Azure App Service?",
     "opts":[
        "User-assigned and Group-assigned",
        "System-assigned and Service Principal",
        "System-assigned and User-assigned",
        "Application and Object"
     ],
     "a":2
  },
  {
     "q":"What must be enabled on the deployment slot before a production swap occurs to ensure application readiness and minimize cold start time?",
     "opts":[
        "Auto Swap",
        "Always On",
        "Warm-up Action",
        "Swap with Preview"
     ],
     "a":3
  },
  {
     "q":"When an App Service is scaled out to multiple instances in a Premium or Standard App Service Plan, what happens to its outbound IP addresses?",
     "opts":[
        "A new, dedicated public IP is created for each instance.",
        "The app continues to use a static, shared list of outbound IPs.",
        "The outbound IP address changes dynamically with each request.",
        "A new outbound IP is registered in Azure DNS."
     ],
     "a":1
  },
  {
     "q":"Which App Service plan tier is required for Zone Redundancy (running instances across multiple Availability Zones)?",
     "opts":[
        "Standard",
        "Basic",
        "Isolated",
        "PremiumV2 or PremiumV3"
     ],
     "a":3
  },
  {
     "q":"What is the command-line environment and diagnostic console associated with App Service (often accessible via the SCM endpoint)?",
     "opts":[
        "Azure Cloud Shell",
        "Kudu Console",
        "Azure CLI",
        "Log Analytics Workspace"
     ],
     "a":1
  },
  {
     "q":"When using deployment slots, which configuration setting property prevents the setting value from being swapped with the code when promoting a slot to production?",
     "opts":[
        "Slot Specific",
        "Sticky Setting",
        "Production Only",
        "Fixed Slot"
     ],
     "a":1
  },
  {
     "q":"In App Service, which feature allows the application code to be run directly from a ZIP file without being extracted, minimizing file lock issues?",
     "opts":[
        "Zip Deploy",
        "Run From Package",
        "Continuous Deployment",
        "FTP Upload"
     ],
     "a":1
  },
  {
     "q":"Which type of DNS record must be configured to map a subdomain (e.g., www.example.com) to an App Service's default hostname?",
     "opts":[
        "A Record",
        "MX Record",
        "CNAME Record",
        "PTR Record"
     ],
     "a":2
  },
  {
     "q":"The maximum scale-out limit for a Standard App Service Plan is how many instances?",
     "opts":[
        "5",
        "10",
        "20",
        "50"
     ],
     "a":1
  },
  {
     "q":"If a Continuous WebJob is deployed to an App Service Plan scaled to four instances, how many instances of the WebJob run by default?",
     "opts":[
        "Zero, continuous jobs only run in the staging slot.",
        "One, as the job runs on a single designated instance.",
        "Four, one instance runs on every App Service instance.",
        "It depends on the `WEBSITES_RUN_FROM_PACKAGE` setting."
     ],
     "a":2
  },
  {
     "q":"Which App Service feature is used to manage user authentication and authorization using providers like Microsoft Entra ID (Azure AD), Google, or Facebook without writing code?",
     "opts":[
        "App Gateway",
        "Key Vault Integration",
        "Easy Auth (Authentication / Authorization)",
        "Azure Identity Protection"
     ],
     "a":2
  },
  {
     "q":"What is the recommended Azure service for in-depth, distributed tracing, application performance monitoring (APM), and dependency mapping for an App Service?",
     "opts":[
        "Azure Monitor Metrics",
        "Azure Storage Logs",
        "Application Insights",
        "Azure Activity Log"
     ],
     "a":2
  },
  {
     "q":"When migrating from an on-premises app to Azure App Service, which feature should you use to securely access resources in your on-premises network using TCP/IP?",
     "opts":[
        "Service Endpoints",
        "Virtual Network Integration",
        "Hybrid Connections",
        "App Service Environment"
     ],
     "a":2
  },
  {
     "q":"For a Linux-based App Service running a Node.js application, which environment variable specifies the startup command or file name to execute?",
     "opts":[
        "NODE_STARTUP_FILE",
        "WEBSITES_NODE_DEFAULT_VERSION",
        "WEBSITES_CONTAINER_STARTUP_COMMAND",
        "WEBSITE_SITE_NAME"
     ],
     "a":2
  },
  {
     "q":"What is the file path within the App Service deployment that contains the application code and content files?",
     "opts":[
        "/site/deployments",
        "/site/wwwroot",
        "/home/site",
        "/usr/local/bin"
     ],
     "a":1
  },
  {
     "q":"What setting is used to force all HTTP traffic to use HTTPS for an App Service application?",
     "opts":[
        "IP Filtering",
        "HTTPS Only",
        "TLS 1.2 Minimum",
        "Always On"
     ],
     "a":1
  },
  {
     "q":"What is the purpose of the `WEBSITES_ENABLE_APP_SERVICE_STORAGE` application setting for Linux Containers?",
     "opts":[
        "It enables the Kudu console.",
        "It controls whether the `/home` directory is mounted for persistence across restarts.",
        "It forces the container to use Azure Files for logging.",
        "It enables SFTP access."
     ],
     "a":1
  },
  {
     "q":"Which App Service feature should be used to provide Web Application Firewall (WAF) capabilities to protect against common attacks like cross-site scripting (XSS)?",
     "opts":[
        "Access Restrictions",
        "Azure Front Door or Application Gateway",
        "Azure Monitor",
        "Easy Auth"
     ],
     "a":1
  },
  {
     "q":"In a CI/CD pipeline, how does Azure App Service typically handle application settings marked as 'sticky' (slot setting) when swapping the Staging slot to Production?",
     "opts":[
        "The sticky settings remain with their respective slots and are not swapped.",
        "All settings, including sticky ones, are swapped to the target slot.",
        "Sticky settings are deleted during the swap.",
        "Sticky settings are copied to the Production slot and removed from Staging."
     ],
     "a":0
  },
  {
     "q":"What is the recommended size of the subnet required for Virtual Network (VNet) Integration in the Basic, Standard, and Premium App Service Tiers?",
     "opts":[
        "A minimum of /24 IP block.",
        "A minimum of /26 IP block.",
        "A minimum of /28 IP block.",
        "A minimum of /30 IP block."
     ],
     "a":2
  },
  {
     "q":"When configuring a Web App for Containers, which required application setting specifies the name of the Docker image to pull?",
     "opts":[
        "DOCKER_IMAGE_NAME",
        "CONTAINER_REGISTRY_URL",
        "DOCKER_CUSTOM_IMAGE_NAME",
        "WEBSITES_CONTAINER_IMAGE_NAME"
     ],
     "a":2
  },
  {
     "q":"Which App Service feature provides network isolation and dedicated resources by deploying the App Service Plan into a subnet of an Azure Virtual Network?",
     "opts":[
        "Virtual Network Integration",
        "Isolated App Service Plan (ASE)",
        "Private Endpoint",
        "PremiumV3 Plan"
     ],
     "a":1
  },
  {
     "q":"What is the key difference between an App Service 'Application Setting' and a 'Connection String' in the Configuration blade?",
     "opts":[
        "Connection Strings are always visible; Application Settings are hidden.",
        "Connection Strings automatically inject provider-specific environment variables for various languages.",
        "Application Settings can be set to be slot-specific; Connection Strings cannot.",
        "Connection Strings are only for SQL Databases; Application Settings are for APIs."
     ],
     "a":1
  },
  {
     "q":"To enable real-time application log streaming from App Service to the Azure Portal, which setting needs to be configured?",
     "opts":[
        "Application Logging (Blob Storage)",
        "Web Server Logging (File System)",
        "Application Insights Telemetry",
        "Application Logging (File System)"
     ],
     "a":3
  },
  {
     "q":"What is the main benefit of using a System-assigned Managed Identity for an App Service?",
     "opts":[
        "It allows the app to connect to resources outside of Azure.",
        "It eliminates the need to manually manage credentials for Azure service access.",
        "It enables centralized logging across all applications.",
        "It provides full administrative access to the App Service Plan."
     ],
     "a":1
  },
  {
     "q":"Which environment variable is used within the App Service application code to identify which deployment slot it is currently running in?",
     "opts":[
        "WEBSITE_SLOT_NAME",
        "AZURE_ENVIRONMENT",
        "APPSETTING_SLOT_ID",
        "DEPLOYMENT_TARGET"
     ],
     "a":0
  },
  {
     "q":"When setting up auto-scale for an App Service Plan, what is the most common metric used to trigger scaling rules for a web application?",
     "opts":[
        "Storage Account Latency",
        "CPU Percentage",
        "Disk Queue Length",
        "Outbound Data Transfer"
     ],
     "a":1
  },
  {
     "q":"In App Service, what is the term for the process of running an application version in a slot with a small percentage of users before a full production release?",
     "opts":[
        "A/B Testing",
        "Canary Deployment",
        "Traffic Routing",
        "Blue/Green Deployment"
     ],
     "a":2
  },
  {
     "q":"Which type of App Service WebJob can be triggered by a CRON expression?",
     "opts":[
        "Continuous WebJob",
        "On-Demand WebJob",
        "Scheduled WebJob",
        "Manual WebJob"
     ],
     "a":2
  },
  {
     "q":"What is the default minimum scale instance count for any App Service Plan (excluding Free/Shared)?",
     "opts":[
        "0",
        "1",
        "2",
        "3"
     ],
     "a":1
  },
  {
     "q":"When a custom domain is mapped to an App Service, what is the primary security requirement for the domain owner to ensure proper DNS resolution and ownership verification?",
     "opts":[
        "Creating a Service Principal in Azure AD",
        "Setting the `WEBSITES_HOSTNAME_BINDING` app setting",
        "Creating a TXT record with the App Service verification ID",
        "Enabling Easy Auth for the domain"
     ],
     "a":2
  },
  {
     "q":"If VNet Integration is configured, but the App Service still uses its public outbound IP for calls to a VNet resource, what is the likely missing component?",
     "opts":[
        "The app is missing a Managed Identity.",
        "The VNet peering is misconfigured.",
        "The VNet Integration subnet is not delegated to Microsoft.Web.",
        "The VNet Integration is only for inbound traffic."
     ],
     "a":2
  },
  {
     "q":"Which App Service diagnostic tool provides a quick analysis and solutions for common problems like high CPU, memory leaks, and application crashes?",
     "opts":[
        "Azure Monitor Log Analytics",
        "Kudu Debug Console",
        "App Service Diagnostics (Diagnose and solve problems)",
        "Azure Advisor"
     ],
     "a":2
  },
  {
     "q":"What is the recommended approach for securely storing secrets like API keys and database credentials that your App Service needs to access?",
     "opts":[
        "Hardcode them in the application settings.",
        "Store them in the `web.config` file.",
        "Use Azure Key Vault and reference them via App Service Application Settings.",
        "Encrypt them directly in the deployment package."
     ],
     "a":2
  },
  {
     "q":"Which file contains the configuration for failed request tracing (FREB) in a Windows App Service?",
     "opts":[
        "diagnostics.xml",
        "settings.job",
        "web.config",
        "host.json"
     ],
     "a":2
  },
  {
     "q":"In App Service, what is the primary purpose of setting the `WEBSITE_TIME_ZONE` application setting?",
     "opts":[
        "To adjust server clock time for log files and application code.",
        "To specify the user's local time for scheduling.",
        "To enable time-based auto-scaling rules.",
        "To control when deployment slots are activated."
     ],
     "a":0
  },
  {
     "q":"When an application uses a custom container, which port is App Service expecting the container to expose for HTTP traffic by default?",
     "opts":[
        "80",
        "443",
        "8080",
        "22"
     ],
     "a":0
  },
  {
     "q":"What is the primary factor that makes a WebJob less suitable than Azure Functions for short-lived, event-driven, pay-per-execution scenarios?",
     "opts":[
        "WebJobs only support C#.",
        "WebJobs scale with the App Service Plan, incurring cost even when idle.",
        "WebJobs cannot be triggered by Azure Storage events.",
        "WebJobs require a dedicated App Service Environment."
     ],
     "a":1
  },
  {
     "q":"What tool should be used inside the Kudu console to explore the App Service file system and view logs?",
     "opts":[
        "PowerShell",
        "Debug Console (CMD or Bash)",
        "Azure CLI",
        "File Explorer"
     ],
     "a":1
  },
  {
     "q":"Which feature provides a secure, private inbound connection from a client in an Azure VNet to the App Service, bypassing the public internet?",
     "opts":[
        "VNet Integration",
        "Private Endpoint",
        "Service Endpoint",
        "IP-based SSL"
     ],
     "a":1
  },
  {
     "q":"To enable the option to automatically swap a staging slot to production upon successful deployment, which App Setting should be configured on the staging slot?",
     "opts":[
        "WEBSITES_AUTO_SWAP_ON_DEPLOYMENT",
        "WEBSITE_AUTO_SWAP",
        "Slot Specific Setting",
        "Auto Swap"
     ],
     "a":3
  },
  {
     "q":"Which App Service deployment method is generally fastest and minimizes the risk of partial deployment failures?",
     "opts":[
        "FTP Upload",
        "Local Git Deployment",
        "Run From Package (Zip Deploy)",
        "WebDeploy"
     ],
     "a":2
  },
  {
     "q":"What is the purpose of the `WEBSITE_HTTPLOGGING_ENABLED` application setting?",
     "opts":[
        "Enables the Web Server (IIS) logs for HTTP requests.",
        "Enables application logging to the file system.",
        "Enables diagnostics for HTTP headers.",
        "Enforces HTTPS for all incoming requests."
     ],
     "a":0
  },
  {
     "q":"Which Azure service is used to distribute traffic globally across multiple App Services in different regions for geo-redundancy and optimal user performance?",
     "opts":[
        "Azure Load Balancer",
        "Azure Traffic Manager",
        "Azure Application Gateway",
        "Azure Virtual Network"
     ],
     "a":1
  },
  {
     "q":"In App Service, where are the application's environment variables and configuration settings stored and encrypted at rest?",
     "opts":[
        "In the `web.config` file",
        "In the Application Settings (Database) by the Azure Resource Manager",
        "In Azure Key Vault only",
        "In the `config.json` file"
     ],
     "a":1
  },
  {
     "q":"What is the maximum traffic percentage that can be routed to a deployment slot using the traffic routing feature?",
     "opts":[
        "50%",
        "75%",
        "99%",
        "100%"
     ],
     "a":2
  },
  {
     "q":"If an App Service is receiving a `502 Bad Gateway` error, which component is most likely failing?",
     "opts":[
        "The client's browser",
        "The backend database",
        "The App Service front-end load balancer connecting to the worker process",
        "The Azure Firewall"
     ],
     "a":2
  },
  {
     "q":"What is the primary benefit of deploying a custom Docker container to App Service Linux instead of a regular code deployment?",
     "opts":[
        "It is cheaper than a standard App Service.",
        "It allows using specific OS dependencies and customized runtimes.",
        "It provides automatic global scaling.",
        "It eliminates the need for an App Service Plan."
     ],
     "a":1
  },
  {
     "q":"Which of the following is NOT a supported method for continuous deployment (CI/CD) to Azure App Service?",
     "opts":[
        "GitHub",
        "Azure DevOps",
        "Azure Blob Storage",
        "Bitbucket"
     ],
     "a":2
  },
  {
     "q":"What happens to the public inbound IP address of an App Service when you scale the App Service Plan from Standard P1V2 to Premium P1V3?",
     "opts":[
        "The public IP address will change.",
        "The public IP address remains the same.",
        "A new Private IP address is created.",
        "The public IP address is immediately hidden."
     ],
     "a":1
  },
  {
     "q":"Which pricing tier is the least expensive option that offers a financial Service Level Agreement (SLA)?",
     "opts":[
        "Free",
        "Shared",
        "Basic",
        "Standard"
     ],
     "a":2
  },
  {
     "q":"To enable remote debugging for an application deployed to App Service, what must be done?",
     "opts":[
        "Enable the 'Always On' setting.",
        "Set the `REMOTE_DEBUGGING_ENABLED` app setting to true.",
        "Ensure the App Service Plan tier supports it (Standard or higher).",
        "Configure a VNet Integration."
     ],
     "a":2
  },
  {
     "q":"What is the correct location for deploying the executable script or compiled code for a WebJob within the App Service structure?",
     "opts":[
        "/site/jobs/continuous/MyJob",
        "/site/wwwroot/jobs/triggered/MyJob",
        "/home/site/wwwroot/MyJob",
        "/app/jobs/continuous/MyJob"
     ],
     "a":1
  },
  {
     "q":"The `health check` feature in App Service is primarily used to inform which service about the instance's availability?",
     "opts":[
        "Azure Monitor only",
        "The App Service Load Balancer for removing unhealthy instances",
        "The application's backend database",
        "Azure Security Center"
     ],
     "a":1
  },
  {
     "q":"What is the purpose of the `SCM_DO_BUILD_DURING_DEPLOYMENT` application setting when deploying source code to App Service?",
     "opts":[
        "It forces the Kudu engine to perform a build step.",
        "It skips the build step and deploys pre-compiled artifacts.",
        "It only runs the build on Windows App Service.",
        "It enables Application Insights during the build."
     ],
     "a":0
  },
  {
     "q":"Which service must be used in conjunction with VNet Integration if you want to force *all* outbound traffic, including internet-bound traffic, through your Virtual Network?",
     "opts":[
        "Private Endpoint",
        "Network Security Group (NSG) on the VNet Integration subnet",
        "Routing All (Route-All) setting on VNet Integration",
        "Azure Traffic Manager"
     ],
     "a":2
  },
  {
     "q":"When running a multi-container application using a Docker Compose file in App Service, which underlying Azure service is utilized?",
     "opts":[
        "Azure Kubernetes Service (AKS)",
        "Azure Container Instances (ACI)",
        "App Service Environment (ASE)",
        "It is handled natively by the App Service worker."
     ],
     "a":3
  },
  {
     "q":"What is the default minimum TLS/SSL protocol version enforced for App Service inbound connections?",
     "opts":[
        "TLS 1.0",
        "TLS 1.1",
        "TLS 1.2",
        "TLS 1.3"
     ],
     "a":2
  },
  {
     "q":"To prevent accidental deletion of a critical App Service resource or App Service Plan, what should be applied?",
     "opts":[
        "An Azure Policy",
        "A Resource Lock (Read-only or Cannot-delete)",
        "A Network Security Group",
        "A Managed Identity"
     ],
     "a":1
  },
  {
     "q":"Which file is required for a scheduled WebJob to define its CRON expression and trigger time?",
     "opts":[
        "schedule.config",
        "settings.job",
        "webjob.json",
        "cron.txt"
     ],
     "a":1
  },
  {
     "q":"Which feature allows an App Service app to retrieve credentials from Azure Key Vault using a URI reference in the application setting value?",
     "opts":[
        "Key Vault Integration",
        "Key Vault Reference",
        "Secret Service Provider",
        "Managed Identity"
     ],
     "a":1
  },
  {
     "q":"If a VNet Integrated App Service needs to resolve a private DNS zone, what must be configured on the VNet?",
     "opts":[
        "Private DNS Zone linkage to the VNet.",
        "An additional CNAME record in Azure DNS.",
        "The App Service must use a Service Principal.",
        "Disable the VNet Integration Route-All setting."
     ],
     "a":0
  },
  {
     "q":"What component of App Service allows a developer to perform advanced troubleshooting like generating memory dumps and viewing environment variables?",
     "opts":[
        "Azure Monitor",
        "Deployment Center",
        "The `w3wp.exe` process",
        "The SCM/Kudu site"
     ],
     "a":3
  },
  {
     "q":"Which of the following is NOT a valid authentication provider for App Service Easy Auth?",
     "opts":[
        "Microsoft Entra ID",
        "Twitter",
        "LinkedIn",
        "GitHub"
     ],
     "a":2
  },
  {
     "q":"If you are using a Free/Shared App Service Plan, what is the consequence of exceeding the allocated CPU time limit?",
     "opts":[
        "Your application will be moved to the Basic tier.",
        "Your application will be throttled or shut down until the next billing cycle.",
        "Azure will automatically scale out your application.",
        "You will be immediately charged for the excess usage."
     ],
     "a":1
  },
  {
     "q":"What is the primary scaling difference between a Premium V3 and an Isolated App Service Plan?",
     "opts":[
        "Premium V3 scales based on HTTP traffic; Isolated scales based on CPU.",
        "Isolated provides a smaller maximum scale count than Premium V3.",
        "Isolated provides total network and compute isolation; Premium V3 is multi-tenant.",
        "Premium V3 supports Linux containers; Isolated does not."
     ],
     "a":2
  },
  {
     "q":"When using a User-assigned Managed Identity with an App Service, what must be done to grant the app access to an Azure resource (e.g., Key Vault)?",
     "opts":[
        "Update the `web.config` file with the identity's secret.",
        "Assign the User-assigned Managed Identity a role on the target resource.",
        "Restart the App Service Plan.",
        "Enable the 'Always On' setting."
     ],
     "a":1
  },
  {
     "q":"Which service can be integrated with App Service to host static assets (like images, CSS, and JavaScript) to improve global performance and reduce load on the App Service?",
     "opts":[
        "Azure Data Factory",
        "Azure Content Delivery Network (CDN)",
        "Azure Service Bus",
        "Azure Event Grid"
     ],
     "a":1
  },
  {
     "q":"What is the effect of configuring `Auto Swap` on a staging slot?",
     "opts":[
        "It triggers a swap to production when the slot's metrics exceed a threshold.",
        "It automatically swaps the slot into production after a successful deployment.",
        "It disables manual swapping via the Azure Portal.",
        "It automatically scales the staging slot to match production."
     ],
     "a":1
  },
  {
     "q":"What are the two common application log output destinations that can be configured in App Service?",
     "opts":[
        "Application Insights and Azure Firewall",
        "File System and Blob Storage",
        "Azure Event Hubs and Azure Cosmos DB",
        "Virtual Network and Public Internet"
     ],
     "a":1
  },
  {
     "q":"Which process should you investigate if you are troubleshooting memory usage on a Windows App Service?",
     "opts":[
        "iisnode.exe",
        "w3wp.exe",
        "kudu.exe",
        "explorer.exe"
     ],
     "a":1
  },
  {
     "q":"What is the maximum number of deployment slots supported by the Premium V3 App Service Plan tier?",
     "opts":[
        "5",
        "10",
        "20",
        "50"
     ],
     "a":2
  },
  {
     "q":"If a deployment slot has a System-assigned Managed Identity, what happens to that identity during a slot swap to production?",
     "opts":[
        "The identity remains tied to the slot and is not swapped.",
        "The identity is swapped along with the code.",
        "The identity is deleted and a new one is created for the production slot.",
        "The identity is automatically converted to a User-assigned identity."
     ],
     "a":0
  },
  {
     "q":"Which networking component allows an App Service to use Network Security Groups (NSGs) to filter its outbound traffic to resources within an Azure VNet?",
     "opts":[
        "Hybrid Connections",
        "IP Access Restrictions",
        "Private Endpoint",
        "VNet Integration"
     ],
     "a":3
  },
  {
     "q":"For a static HTML site, which App Service feature provides the most cost-effective and simple hosting solution?",
     "opts":[
        "App Service Environment",
        "App Service Standard Plan",
        "Static Web Apps or Azure Storage Static Websites",
        "App Service with a Linux Container"
     ],
     "a":2
  },
  {
     "q":"Which Kudu utility can be used to manually take a snapshot of the application process memory for later analysis (a memory dump)?",
     "opts":[
        "Process Explorer",
        "Log Stream",
        "WebJobs Dashboard",
        "Environment Settings"
     ],
     "a":0
  },
  {
     "q":"What is the purpose of the App Service 'Backup' feature?",
     "opts":[
        "To create a snapshot of the App Service Plan configuration.",
        "To create an automated, point-in-time copy of application files and database content.",
        "To provide immediate disaster recovery by replicating the site to another region.",
        "To automatically apply security patches to the OS."
     ],
     "a":1
  },
  {
     "q":"What happens if you try to deploy a new version of code via FTP and a file is currently locked by the running application process?",
     "opts":[
        "The deployment automatically succeeds, and the file is updated.",
        "The deployment is queued until the file is released.",
        "The deployment fails with a 'file lock' error.",
        "The App Service instance is automatically restarted to unlock the file."
     ],
     "a":2
  },
  {
     "q":"For an App Service in the Isolated pricing tier (ASE), what is the billing model?",
     "opts":[
        "Pay-per-execution model (like Consumption Functions).",
        "The cost of the ASE stamp plus the cost of the worker instances (V-cores).",
        "A fixed monthly fee for unlimited apps.",
        "Billed based on total HTTP requests and data transfer."
     ],
     "a":1
  },
  {
     "q":"What is the advantage of using an ALIAS record over an A record to map a naked domain to an App Service?",
     "opts":[
        "ALIAS records do not require ownership verification.",
        "ALIAS records allow the naked domain to resolve to the App Service's public IP address, which may change.",
        "A records are only for subdomains, ALIAS is for naked domains.",
        "ALIAS records support only HTTPS traffic."
     ],
     "a":1
  },
  {
     "q":"Which App Service setting controls the maximum length of time a request can take before the App Service load balancer times it out?",
     "opts":[
        "Request Timeout (This is the most common answer in practice, even if the actual setting is internal to the load balancer/App Gateway/Front Door)",
        "Connection String Timeout",
        "Always On",
        "WEBSITE_LOAD_BALANCER_TIMEOUT"
     ],
     "a":0
  },
  {
     "q":"In App Service, how can you configure the application's runtime version (e.g., .NET, PHP, Java) for a Windows Web App?",
     "opts":[
        "In the `web.config` file only.",
        "Via the Configuration blade in the Azure Portal.",
        "By selecting the App Service Plan OS type.",
        "It cannot be changed after creation."
     ],
     "a":1
  },
  {
     "q":"What is the purpose of enabling the 'FTP state' to FTPS Only in App Service?",
     "opts":[
        "To enforce secure data transfer for file deployments.",
        "To disable the Kudu console.",
        "To enable FTPS for external clients only.",
        "To allow unencrypted FTP traffic."
     ],
     "a":0
  },
  {
     "q":"Which App Service feature allows a small set of users to test a new version of the app in a deployment slot without affecting the majority of production traffic?",
     "opts":[
        "Staging Slot Health Check",
        "Traffic Routing Percentage",
        "Auto-Scaling Profiles",
        "A/B Testing with Application Gateway"
     ],
     "a":1
  },
  {
     "q":"What is the recommended Azure service to use instead of a WebJob if the task is short-lived, requires automatic scaling based on load, and you only want to pay for execution time?",
     "opts":[
        "Azure Logic Apps",
        "Azure Functions (Consumption Plan)",
        "Azure Virtual Machine Scale Sets",
        "Azure Batch"
     ],
     "a":1
  },
  {
     "q":"When an App Service is configured with a Private Endpoint, what ensures clients resolve the app's hostname to the private IP address instead of the public IP?",
     "opts":[
        "An entry in the hosts file of the client VM.",
        "The App Service automatically configures the Private DNS Zone.",
        "A new Public IP is provisioned.",
        "The client must use a dedicated connection string."
     ],
     "a":1
  }
